/*================================================================================
 * 文件描述: 数据链表 
 * 文件版本: V1.00
 * 开发人员: wangrq
 * 定版时间:
 * 版本修订:
 * 修订人员:
 *================================================================================*/

#ifndef _DATALIST_DEMO_H_
#define _DATALIST_DEMO_H_


//#include "Resource.h"
//#include "InstCell.h"
#include "Macro.h"

#ifdef __cplusplus
extern "C" {
#endif

/*================================================================================*/


/*================================================================================
 * 对外声明函数
 *================================================================================*/
extern int DataListDemo(void);
extern void DataListShow(tagListCtrl *ptListCtrl);
/*================================================================================*/

#ifdef __cplusplus
}
#endif

#endif
