/*================================================================================
 * 文件描述: 随机数 
 * 文件版本: V1.00
 * 开发人员: wangrq
 * 定版时间:
 * 版本修订:
 * 修订人员:
 *================================================================================*/

#ifndef _DATARANDOM_H_
#define _DATARANDOM_H_


//#include "Resource.h"
//#include "InstCell.h"
#include "Macro.h"
#include <stdlib.h>
#include <time.h>


#ifdef __cplusplus
extern "C" {
#endif

/*================================================================================*/

#define M_SetRandomSeed()	srand((int)time(0))		// 设置随机数种子 
#define M_GetRandom(x) 		(rand()%x)				// 获取随机数 


/*================================================================================
 * 对外声明函数
 *================================================================================*/



/*================================================================================*/


#ifdef __cplusplus
}
#endif

#endif
